
group1 = ["Иванов", "Петров", "Сидоров", "Кузнецов", "Попов", "Смирнов", "Васильев", "Михайлов", "Новиков", "Федоров"]
group2 = ["Александров", "Морозов", "Волков", "Соловьев", "Лебедев", "Егоров", "Козлов", "Степанов", "Орлов", "Андреев"]


team = tuple(group1[:5] + group2[:5])


print("Группа 1:", group1)
print("Группа 2:", group2)
print("Спортивная команда:", team)

# Выводим длину кортежа
print("Длина команды:", len(team))


sorted_team = tuple(sorted(team))
print("Отсортированная команда:", sorted_team)


ivanov_count = team.count("Иванов")
if ivanov_count > 0:
    print(f"Студент 'Иванов' входит в коjманду. Количество вхождений: {ivanov_count}")
else:
    print("Студент 'Иванов' не входит в команду.")